/******************************************************************************

                  版权所有 (C), 2001-2100, 四川省新健康成股份有限公司

 ******************************************************************************
  文 件 名   : app_testcase.h
  版 本 号   : 初稿
  作    者   : zxc
  生成日期   : 2016年1月14日
  最近修改   :
  功能描述   : app_testcase.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年1月14日
    作    者   : zxc
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#ifndef __APP_TESTCASE_H__
#define __APP_TESTCASE_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

extern vos_u32 app_initTestCase( void );
extern vos_u32 app_procTestResult(vos_msg_header_stru* pstvosmsg);
extern vos_u32 app_registerFaultid( void );
extern void app_reportMargin( void );
extern vos_u32 app_simuReportFault(vos_u32 faultid);

vos_u32 app_testReagSysR1Vrtfault();
vos_u32 app_testReagSysR1DischPosFault();

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __APP_TESTCASE_H__ */
